# #математические операторы

# # a^b - a**b степень

# a = 5
# b = 4


# print(f'{a}+{b}={a+b}')
# print(f'{a}-{b}={a-b}')
# print(f'{a}*{b}={a*b}')
# print(f'{a}/{b}={a/b}')
# print(f'{a}^{b}={a**b}')
# print(f'{(a*b)**(1/2)}')


#задача 1
import math
a = int(input('введи сторону квадрата - '))
p = 4*a
s = a**2
print(f'периметр = {p}')
print(f'площадь = {s}')

a = int(input('введи сторону 1 прямоугольника - '))
b = int(input('введи сторону 2 прямоугольника - '))

p1 = 2*(a+b)
s1 = a*b
print(f'периметр = {p1}')
print(f'площадь = {s1}')

#задача 4

d = int(input('диаметр окружности - '))
l = 3.14*d
print(f'длина окружности = {l}')

#задача 5 

a2 = int(input('введи длину ребра куба - '))
v = a2**3
s2 = 6*(a2**2)

print(f'объем куба = {v}')
print(f'площадь поверхности куба = {s2}')

#задача 6
print('введи стороны параллелепипеда')
a = int(input('a = '))
b = int(input('b = '))
c = int(input('c = '))
v = a*b*c
s = 2*(a*b+b*c+a*c)
print(f'объем = {v}')
print(f'площадь = {s}')

#задача 7
r = int(input('задай радиус - '))
l = 2*3.14*r
s = 3.14*r**2
print(f'длина = {l}')
print(f'площадь = {s}')

#задача 8 
a = int(input('число 1 - '))
b = int(input('число 2 - '))
A = (a+b)/2
print(f'среднее арифметическое = {A}')

#задача 9 
a = int(input('число 1 - '))
b = int(input('число 2 - '))
G = (a*b)**(1/2)
print(f'среднее геометрическое = {G}')

#задача 10
a = int(input('число 1 - '))
b = int(input('число 2 - '))

c1 = a+b
c2 = a-b
c3 = a*b
c4 = a/b
print(f'сумма = {c1}')
print(f'разность = {c2}')
print(f'частное = {c3}')
print(f'частное = {c4}')

#задача 12
a = int(input('катет 1 - '))
b = int(input('катет 2 - '))

c = ((a**2)+(b**2)) ** (1/2)
p = a+b+c
print(f'гипотенуза = {c}')
print(f'периметр = {p}')

#задача 13
r1 = int(input('задай радиус 1 - '))
r2 = int(input('задай радиус 2 - '))
s1 = 3.14*(r1**2)
s2 = 3.14*(r2**2)
s3 = s1-s2

print(f'S1 = {s1}')
print(f'S2 = {s2}')
print(f'S3 = {s3}')


#задача 14
l = int(input('задай длину - '))

r = l/6.28
s = 3.14*(r**2)

print(f'радиус = {r}')
print(f'площадь = {s}')

#задача 15
s = int(input('задайте площадь круга - '))
d = (4*s/3.14)**(1/2)
l = 3.14*d

print(f'диаметр окружности = {d}')
print(f'длина окружности = {l}')

#задача 16
x1 = int(input("координата x1 - "))
x2 = int(input("координата x2 - "))
d = abs(x2 - x1)
print(f'Расстояние между точками = {d}')

#задача 17
print('введи значения точек ABC')
a = int(input('a - '))
b = int(input('b - '))
c = int(input('c - '))

ac = c-a
ab = b-a
bc = c-b
sum1 = ac+bc

print(f'AC = {ac}')
print(f'BC = {bc}')
print(f'сумма AC и BC = {sum1}')

#задача 18
print('введи значения точек ACB')
a = int(input('a - '))
c = int(input('c - '))
b = int(input('b - '))

ac = c-a
ab = b-a
cb = b-c
pp = ac*cb
print(f'произведение AC и BC = {pp}')

#задача 19
x1 = int(input('x1 - '))
x2 = int(input('x2 - '))
y1 = int(input('y1 - '))
y2 = int(input('y2 - '))
x = x2-x1
y = y2-y1
p = 2*(x+y)
s = x*y
print(f'периметр = {p}')
print(f'площадь = {s}')

#задача 20
x1 = int(input('x1 - '))
x2 = int(input('x2 - '))
y1 = int(input('y1 - '))
y2 = int(input('y2 - '))

gg = ((x2-x1)**2+(y2-y1)**2)**(1/2)
print(f'расстояние между координатами = {gg}')


#задача 21
print('введи значения координат вершин треугольника')
x1 = int(input('x1 - '))
x2 = int(input('x2 - '))
x3 = int(input('x3 - '))

y1 = int(input('y1 - '))
y2 = int(input('y2 - '))
y3 = int(input('y3 - '))

a = ((x2-x1)**2+(y2-y1)**2)**(1/2) #между (x1 y1) и (x2 y2)
b = ((x3-x2)**2+(y3-y2)**2)**(1/2)
c = ((x1-x3)**2+(y1-y3)**2)**(1/2) 

p = (a+b+c)/2
s = (p*(p-a)*(p-b)*(p-c))**(1/2)
print(f'периметр = {p}')
print(f'площадь = {s}')


# задача 22
a = int(input('значение a - '))
b = int(input('значение b - '))

print(f'новые значения a = {b} и b = {a}')

#задача 23
a = int(input('значение a - '))
b = int(input('значение b - '))
c = int(input('значение c - '))

print(f'новые значения a = {b}, b = {c} и c = {a}')

#задача 24
a = int(input('значение a - '))
b = int(input('значение b - '))
c = int(input('значение c - '))

print(f'новые значения a = {c}, b = {a} и c = {b}')

#задача 25
print('для функции y = 3*x^6-6*x^2-7 задай значение x')
x = int(input('x = '))
y = 3*x**6-6*x**2-7
print(f'y = {y}')

#задача 26
print('для функции y = 4*(x-3)^6-(x-3)^3+2 задай значение x')
x = int(input('x = '))
y = 4*(x-3)**6-(x-3)**3+2
print(f'y = {y}')

#задача 27
a = int(input('a = '))

print(f'a2 = {a**2}, a4 = {a**4}, a8 = {a**8}')

#задача 28
a = int(input('a = '))

print(f'a2 = {a**2}, a3 = {a**3}, a5 = {a**5}, a10 = {a**10}, a15 = {a**15}')

#задача 29
d = int(input('значение угла - '))
print(f'значение в радианах = {d*3.14/180}')

#задача 30 
d = int(input('значение угла в радианах - '))
print(f'значение в градусах = {d*180/3.14}')

#задача 31
c = int(input('задать в Цельсиях - '))
f = 9/5*c + 32
print(f'значение в фарангейтах = {f}')

#задача 32
c = int(input(' задать в Фарангейтах - '))
print(f'значение в цельсиях = {(c - 32) * 5/9}')

#задача 33
print('задача по определению цены яблок')
x = int(input('масса яблок - '))
a = int(input('за сколько купил - '))
m = a/x #цена 1кг яблок
y = int(input('сколько кг яблок хочешь купить - '))
c = m*y #цена y кг яблок

print(f'цена 1кг яблок = {m}, стоимость твоих яблок = {c}')

#задача 34
a = int(input('стоимость шоколадных - '))
x = int(input('масса шоколадных - '))
b = int(input('стоимость ирисок - '))
y = int(input('масса ирисок - '))

ax = a/x #цена шоколадных
by = b/y #цена ирисок
ab = ax/by #соотношение шоко к ирискам

print(f'''цена шоколадных = {ax}
      цена ирисок = {by}
      соотношение шоколадных к ирискам = {ab}''')

#задача 35
print('задача с лодкой')

v1 = int(input('скорость лодки в стоячей воде - '))#стоячая вода
v2 = int(input('скорость течения - '))#скорость течения
t1 = int(input('время движения в стоячей воде - '))#стоячая вода
t2 = int(input('время движения против течения - '))#против течения
s = (v1-v2)*t2
print(f'путь пройденный лодкой по реке = {s}')

#задача 36
v1 = int(input('скорость первой тачки - '))
v2 = int(input('скорость второй тачки - '))
t = int(input('время - '))
s = int(input('начальное расстояние между тачками - '))
s1 = v1*t
s2 = v2*t
x = (s1+s2)+s
print(f'расстояние между тачками = {x}')

#задача 37
v1 = int(input('скорость первой тачки - '))
v2 = int(input('скорость второй тачки - '))
t = int(input('время - '))
s = int(input('начальное расстояние между тачками - '))
s1 = v1*t
s2 = v2*t
x = s-(s1+s2)
print(f'расстояние между тачками = {x}')

#задача 38
print('ax+b=0 -> x = -b/a')
a = int(input('введи значение a - '))
b = int(input('значение b - '))
x = -(b/a)
if a == 0:
    print('a не равно нулю')
else:
      print(f'значение x = {x}')

#задача 39
print('''уравнение - ax^2+bx+c=0. задай значения''')
a = int(input('введи значение a - '))
b = int(input('значение b - '))
c = int(input('значение c - '))
D = b**2-4*a*c
x1 = (-b+(D**0.5))/(2*a)
x1 = (-b-(D**0.5))/(2*a)
if D<0:
     print('нет корней')
else:
     print(f'x1 = {x1}, x2 = {x2}')

#задача 40
print('''дана система уравнений
a1x+b1y=c1
a2x+b2y=c2''')
a1 = int(input('a1 - '))
b1 = int(input('b1 - '))
a2 = int(input('a2 - '))
b2 = int(input('b2 - '))
c1 = int(input('c1 - '))
c2 = int(input('c2 - '))

D = a1*b2-a2*b1
x = (c1*b2-c2*b1)/D
y = (a1*c2-a2*c1)/D

print(f'''x = {x}
y = {y}''')

#FINISH
print('thats all')