# // - целая часть
# % - дробная часть


#1
l = int(input('в см - '))
m = l//100
print(f'целых метров - {m}')

#2
m = int(input('в кг - '))
t = m//1000
print(f'целых тонн - {t}')

#3
b = int(input('в байтах - '))
kb = b//1024
print(f'полных кБ - {kb}')

#4
a = int(input('a - '))
b = int(input('b - '))
print(f'количество отрезка b на a - {a//b}')

#5
a = int(input('a - '))
b = int(input('b - '))
print(f'количество отрезка оставшейся длины b - {a%b}')

#6
a = int(input('введи двузначное число - '))
if a > 99:
    print('меньше 100')
else:
    print(f'''левая цифра - {a//10}
правая цифра - {a%10}
''')

#7
a = int(input('введи двузначное число - '))
m = a//10
n = a%10
print(f'''сумма цифр числа = {m+n}
умножение цифр числа = {m*n}
''')

#8
a = int(input('введи двузначное число - '))
m = a//10
n = a%10
print(f'перестановленное число - {n}{m}')

#9
a = int(input('введи трехзначное число - '))
print(f'первая цифра числа = {a//100}')

#10
a = int(input('введи трехзначное число - '))

m = a%100
m1 = m%10 #последняя цифра
m2 = m//10 #средняя цифра
print(f'''последняя цифра - {m1} 
      средняя цифра - {m2}''')

#11
a = int(input('введи трехзначное число - '))
m1 = a//100
m2 = (a%100)//10
m3 = (a%100)%10
print(f'сумма цифр = {m1+m2+m3}')

#12
a = int(input('введи трехзначное число - '))
m1 = a//100
m2 = (a%100)//10
m3 = (a%100)%10
print(f'сумма цифр = {m3}{m2}{m1}')

13
a = int(input('введи трехзначное число - '))
m1 = a//100
m2 = (a%100)//10
m3 = (a%100)%10
print(f'сумма цифр = {m2}{m3}{m1}')

#14
a = int(input('введи трехзначное число - '))
m1 = a//100
m2 = (a%100)//10
m3 = (a%100)%10
print(f'сумма цифр = {m3}{m1}{m2}')

#15
a = int(input('введи трехзначное число - '))
m1 = a//100
m2 = (a%100)//10
m3 = (a%100)%10
print(f'сумма цифр = {m2}{m1}{m3}')

#16
a = int(input('введи трехзначное число - '))
m1 = a//100
m2 = (a%100)//10
m3 = (a%100)%10
print(f'сумма цифр = {m1}{m3}{m2}')

17
a = int(input('введи число больше 999 - '))
m = (a%1000)//100
print(f'вторая цифра числа - {m}')

#18
a = int(input('введи число больше 999 - '))
m = a//1000
print(f'первая цифра - {m}')

#19
a = int(input('введи время в секундах - '))
m = a//60
print(f'полных минут - {m}')

#20
a = int(input('введи время в секундах - '))
m = a//60//60
print(f'полных часов - {m}')

#21
a = int(input('введи время в секундах - '))
m = a%60
print(f'прошло в последней минуте {m} секунд')

#22
a = int(input('введи время в секундах - '))
m = a//60%60
print(f'прошло за последний час - {m} секунд')

#23
a = int(input('введи время в секундах - '))
m = a//60
m1 = m//60
print(f'прошло за последний час - {m1} минут')

# 0 - sunday
# 1 - monday
# 2 - tuesday
# 3 - wednesday
# 4 - thursday
# 5 - friday
# 6 - saturday


#24 kogda 1 chislo pn
a = int(input('введи число от 1 до 365 - '))
day = (1+(a-1))%7
print(f'номер дня недели - {day}')

#25 kogda 1 chislo cht
a = int(input('введи число от 1 до 365 - '))
day = (a+3)%7
print(f'номер дня недели - {day}')

#26 kogda 1 chislo vt
a = int(input('введи число от 1 до 365 - '))
day = a%7+1
print(f'номер дня недели - {day}')

#27
a = int(input('введи число от 1 до 365 - '))
day = (a+5)%7+1
print(f'номер дня недели - {day}')

#28
a = int(input('введи число от 1 до 365 - '))
day=((n-1)+(a-1)) % 7 + 1
print(f'номер дня недели - {day}')

#29
A = int(input("введи A: "))
B = int(input("введи B: "))
C = int(input("введи C: "))

n = (A // C) * (B // C)
s1 = A * B - n * (C * C)

print(f'количество квадратов - {n}')
print(f'незанятая площадь - {s1}')

#30 I = 1-100, II = 101-200 ... XX = 1901-2000
year = int(input('введи год - '))
cen = year//100
if year<=100:
    print('первый век')
else:
    print(f'век - {cen+1}')
if year<=0:
    print('до нашей эры')


print('that\'s the end')